10/data/attachments/89ccbfc161680b20.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_93ff4070-cf5c-40b5-82d5-9452476aa2ca</nif:username>
            <nif:friendToBeAdded>Samantha_they_Friend_3080_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>